myrottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    if (@movie.update(movie_params))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars <3"], ["updated_at", "2023-11-23 18:20:03.706467"], ["id", 1]]